import React from "react";
import "./OrderPolicy.css";

const OrderPolicy = () => {
  return (
    <div className="policy-container">
      <h1>سياسة الطلب</h1>
      <p>آخر تحديث: 08/02/2026</p>
      
      <h2>عملية الطلب</h2>
      <p>أضف المنتجات  إلى السلة، أكمل الدفع. يمكنك تتبع حالة الطلب من خلال حسابك.</p>
      
      <h2>التأكيد والإلغاء</h2>
      <p>الطلب ملزم بعد تأكيد الدفع. لا يمكن الإلغاء بعد ذلك، وفقًا لقانون التجارة الإلكترونية في المملكة.</p>
      
      <h2>التعديل</h2>
      <p>اتصل بنا فورًا لتعديل الطلب قبل الشحن عبر البريد FETRA7@hotmail.com أو حساب الإنستغرام.</p>
      
      <h2>التوافر</h2>
      <p>التوافر يظهر على صفحة المنتج (متوفر أو غير متوفر). إذا كان المنتج غير متوفر بعد الطلب، سنبلغك ونرد المبلغ فورًا.</p>
      
      <p>للاستفسارات: FETRA7@hotmail.com</p>
    </div>
  );
};

export default OrderPolicy;