import React from "react";
import "./ReturnPolicy.css";

const ReturnPolicy = () => {
  return (
    <div className="policy-container">
      <h1>سياسة الاسترجاع والاستبدال</h1>
      <p>آخر تحديث: 08/02/2026</p>
      
      <h2>شروط الاسترجاع</h2>
      <p>يمكنك إرجاع المنتج خلال 3 أيام من التسليم إذا كان تالفًا أو مختلفًا عن الصورة، وغير مستخدم. لا نسترجع المنتجات بسبب سوء الاستخدام أو الاختلاف الطفيف الناتج عن التصنيع اليدوي. نحن ملتزمون بحقوق المستهلكين وفق قانون التجارة الإلكترونية في المملكة.</p>
      
      <h2>عملية الاسترجاع</h2>
      <p>اتصل بنا عبر FETRA7@hotmail.com أو حساب الإنستغرام مع رقم الطلب وصورة للمنتج. سنرسل تعليمات الشحن. رسوم الشحن على العميل إلا إذا كان الخطأ من جانبنا.</p>
      
      <h2>الاستبدال</h2>
      <p>الاستبدال مجاني إذا كان المنتج معيبًا. يمكن الاستبدال بنفس القطعة  خلال 3 أيام.</p>
      
      <h2>الاسترداد</h2>
      <p>يتم الاسترداد خلال 5-10 أيام عمل بعد الفحص، عبر نفس طريقة الدفع.</p>
      
      <p>للاستفسارات: FETRA7@hotmail.com</p>
    </div>
  );
};

export default ReturnPolicy;