import React from "react";
import "./Terms.css";

const Terms = () => {
  return (
    <div className="policy-container">
      <h1>الشروط والأحكام</h1>
      <p>آخر تحديث: 08/02/2026</p>
      
      <h2>مقدمة</h2>
      <p>باستخدام موقع فطرة، توافق على هذه الشروط والأحكام وفقًا لقانون التجارة الإلكترونية في المملكة العربية السعودية (صادر في 2019). إذا لم توافق، يرجى عدم الاستخدام. نحن ملتزمون بحماية حقوق المستهلكين وزيادة الثقة في المعاملات الإلكترونية.</p>
      
      <h2>التسجيل والحساب</h2>
      <p>يجب أن تكون بياناتك دقيقة ومحدثة. نحن غير مسؤولين عن أي خسائر ناتجة عن كلمة مرور ضعيفة أو عدم تحديث البيانات. يمكنك إنشاء حساب باستخدام  رقم الهاتف.</p>
      
      <h2>الطلبات والدفع</h2>
      <p>الطلبات ملزمة بعد التأكيد. نقبل الدفع عبر البطاقة البنكية أو Apple Pay من خلال خدمة Moyasar. الدفع يتم تأكيده فورًا، ولا يمكن إلغاء الطلب بعد ذلك. انظر سياسة الدفع للتفاصيل.</p>
      
      <h2>الشحن والتسليم</h2>
      <p>نشحن المنتجات  خلال اسبوعين عمل داخل المملكة، ونحن غير مسؤولين عن تأخيرات الشحن الخارجية الناتجة عن شركات الشحن.</p>
      
      <h2>الإرجاع والاسترداد</h2>
      <p>انظر سياسة الاسترجاع والاستبدال للتفاصيل. نحن ملتزمون بحقوق المستهلكين وفق قانون التجارة الإلكترونية.</p>
      
      <h2>حقوق الملكية الفكرية</h2>
      <p>جميع المحتويات والتصاميم على الموقع، بما في ذلك المنتجات ، ملك لعلامة فطرة. لا تستخدمها بدون إذن كتابي.</p>
      
      <h2>الإخلاء من المسؤولية</h2>
      <p>الموقع مقدم "كما هو"، بدون ضمانات صريحة أو ضمنية. نحن غير مسؤولين عن أي أضرار ناتجة عن الاستخدام، بما يتوافق مع القوانين السعودية.</p>
      
      <h2>التغييرات</h2>
      <p>قد نعدل الشروط، وسنعلن عن التغييرات هنا أو عبر حساباتنا على Instagram وTikTok. استمرار استخدام الموقع يعني قبول التعديلات.</p>
      
      <p>للاستفسارات: FETRA7@hotmail.com</p>
    </div>
  );
};

export default Terms;